/***************************************************************************************************************\
*																												*
*									ћќƒ”Ћ№ —ќ ¬—ѕќћќ√ј“≈Ћ№Ќџћ» ѕ≈–≈ћ≈ЌЌџћ»										*
*												(ќЅЏя¬Ћ≈Ќ»я)													*
*																												*
*					перевод всей строки в нижний регистр, рекурсивный поиск файлов (PE)							*
*																												*
*											StrToLower, FindPE													*
*																												*
\***************************************************************************************************************/



#pragma once 



//#include <windows.h>
#include "xlist.h" 



#define MAX_LEN 512	//максимальна€ длина строки
#define MAX_RECURS_LEVEL 30 //макисмальный уровень рекурсии дл€ функи поиска файлов (можно сделать больше при необходимости); 



char *StrToLower(char *pStr);
BOOL FindPE(char *pszDir, char *pszMask, LPVOID fnFunc);
 